{
  "case-001": {
    "title": "消えたブリーフケース",
    "description": "機密書類が入ったブリーフケースがブルーノート・ラウンジから消えました。手がかりを辿って犯人を特定してください。",
    "brief": "荒廃した1980年代を舞台に、貴重なブリーフケースがブルーノート・ラウンジから消えました。目撃者によると、トレンチコートを着た男が現場から逃げるのが見られたとのことです。犯罪現場を調査し、容疑者のリストを確認し、面接記録を調べて犯人を明らかにしてください。",
    "objectives": [
      "重要な手がかりを集めるため、正しい犯罪現場の詳細を取得してください。",
      "目撃者の説明に一致するプロフィールを持つ容疑者を特定してください。",
      "面接記録を使用して容疑者を確認してください。"
    ],
    "successMessage": "おめでとうございます、探偵さん！ヴィンセント・マローンが犯人であることを特定しました。",
    "explanation": "まず、'crime_scene'テーブルから犯罪現場の詳細を取得し、左頬に傷のあるトレンチコートを着た男について言及されていることがわかりました。次に、'suspects'テーブルをクエリして、候補を2人に絞りました。最後に、'interviews'テーブルを調べて、ヴィンセント・マローンが実際にブリーフケースを盗んだことを確認しました。"
  },
  "case-002": {
    "title": "盗まれた音",
    "description": "貴重なレコードがウエスト・ハリウッド・レコードから盗まれました。手がかりを辿って犯人を明らかにしてください。",
    "brief": "1980年代のロサンゼルスのネオンの輝きの中、ウエスト・ハリウッド・レコード店は大胆な窃盗事件に見舞われました。1万ドル以上の価値がある貴重なレコードが、忙しい夕方に消え、店主は答えを必死に求めています。\n詳細を曖昧に思い出すと、事件は1983年7月15日にこの有名な店で発生したことがわかっています。あなたの任務は、泥棒を追跡して裁きにかけることです。",
    "objectives": [
      "既知の日付と場所を使用して、レコード窃盗の犯罪現場報告を取得してください。",
      "その犯罪現場に関連する目撃者の記録を取得して、手がかりを得てください。",
      "目撃者からの手がかりを使用して、容疑者テーブルで容疑者を見つけてください。",
      "容疑者の面接記録を取得して、自白を確認してください。"
    ],
    "successMessage": "素晴らしい仕事です、探偵さん！リコ・デルガドが貴重なレコードを盗んだことを自白しました。",
    "explanation": "'crime_scene'テーブルを日付（19830715）と場所（ウエスト・ハリウッド・レコード）でクエリして事件報告を見つけることから始めました。次に、'witnesses'テーブルから2つの目撃者記録を取得し、以下のことが明らかになりました：\n• 容疑者は赤いバンダナを着用していた。\n• 容疑者は特徴的な金色の時計を持っていた。\n次に、'suspects'テーブルをクエリし、手がかりに一致する容疑者が3人いました。\n最後に、'interviews'テーブルでリコ・デルガドの自白を見つけました。"
  },
  "case-003": {
    "title": "マイアミ・マリーナ殺人事件",
    "description": "コーラル・ベイ・マリーナで遺体が発見されました。2人の潜在的な容疑者が現場近くで最後に目撃されました。殺人犯を見つけて裁きにかけてください。",
    "brief": "1986年8月14日の早朝、コーラル・ベイ・マリーナの桟橋近くで遺体が浮いているのが発見されました。探偵さん、あなたの仕事は殺人犯を見つけて裁きにかけることです。\nこの事件には、JOIN、ワイルドカード検索、論理的推論の使用が必要になるかもしれません。さあ、仕事に取りかかってください、探偵さん。",
    "objectives": [
      "殺人犯を見つけてください。（まず犯罪現場を見つけることから始めてください）"
    ],
    "successMessage": "素晴らしい探偵の仕事です！トーマス・ブラウンが犯罪を自白しました。",
    "explanation": "捜査は、犯罪現場から2人の容疑者から始まりました。1人はオーシャン・ドライブに住んでおり、もう1人は名前が「ez」で終わっていました。\n彼らに面接した後、ホテルのチェックインは2つの別々の手がかりを使用してフィルタリングされました—まず日付で、次に監視記録を使用してさらに絞り込みました。\n3人だけが両方のフィルターに一致しました。\nそれぞれに面接すると、事件における彼らの役割が明らかになり、さらに追及した後、トーマス・ブラウンが犯罪を自白しました。"
  },
  "case-004": {
    "title": "真夜中の仮面舞踏会殺人事件",
    "description": "レオナルド・ピアースがココナッツ・グローブの仮面舞踏会で殺害されました。手がかりを辿って真の殺人犯を明らかにしてください。",
    "brief": "1987年10月31日、ココナッツ・グローブの邸宅での仮面舞踏会で、レオナルド・ピアースが庭で死んでいるのが発見されました。すべての手がかりをつなぎ合わせて、真の殺人犯を暴くことができますか？",
    "objectives": [
      "この複雑な事件の真の殺人犯を明らかにしてください。"
    ],
    "successMessage": "優れた探偵の仕事です！証拠は決定的にマルコ・サントスが真の殺人犯であることを示しています。",
    "explanation": "犯罪現場の記録を取得し、目撃者の証言を調べることから始めました。証言には、グランド・リージェンシーでのホテル予約（19871030の707号室）が言及されていました。\nこれらの手がかりでホテルのチェックインをフィルタリングすると、複数のエントリが返されました。\n監視記録とのJOINにより、電話で叫んでいる被写体（「殺してやる！」）を記録した1つの重要なエントリに絞り込まれました。\n電話記録を確認すると、ヴィクター・ディマルコへの電話で「なぜ彼を殺したんだ、兄弟？大工に仕事をさせるべきだったのに！」というフレーズが含まれていることがわかりました。\nその電話の受信者を特定して面接すると、彼は殺人者ではないことが明らかになりましたが、真の殺人者はランボルギーニを運転する大工であることが示唆されました。\n車両登録と人物テーブルを結合し（職業「大工」と車のモデル「ランボルギーニ」でフィルタリング）、1人の候補者が得られました。\nその候補者との最終面接により、自白が得られました。\nしたがって、真の殺人犯はマルコ・サントスです。"
  },
  "case-005": {
    "title": "シリコン破壊工作事件",
    "description": "マイアミの主要なテクノロジー企業が画期的なマイクロプロセッサを発表しようとしていました。発表のわずか数時間前に、プロトタイプが破壊されました。",
    "brief": "マイアミの主要なテクノロジー企業であるクアンタムテックは、「QuantaX」と呼ばれる画期的なマイクロプロセッサを発表しようとしていました。発表のわずか数時間前に、プロトタイプが破壊され、すべての研究データが消去されました。探偵は企業スパイを疑っています。",
    "objectives": [
      "マイクロプロセッサを破壊した人物を見つけてください。"
    ],
    "successMessage": "優れた探偵の仕事です！証拠は決定的にフリスト・ボゴエフが真の破壊工作者であることを示しています。",
    "explanation": "プロトタイプの破壊に関するクアンタムテックからの事件報告を取得することから始めました。カール・ジェンキンスとティナ・ルイスの2人の目撃者が最初に特定されました。\nティナ・ルイスは、「QX-」とマークされたキーカードに続いて奇数の2桁の数字を持つ誰かを見たと述べました。そのようなパターンでキーカードアクセスログをフィルタリングすると、20以上の結果が返され、範囲が広すぎました。\nカール・ジェンキンスは、ヘルシンキのサーバーにリンクされた異常なサーバーアクティビティを報告しました。ヘルシンキアクセスのコンピュータアクセスログを検索すると、再び多くのエントリが返されました。\nただし、キーカードアクセスとコンピュータアクセスログの間でJOINを実行すると、リストはエリザベス・ゴードンに絞り込まれました。\n彼女をさらに調査して、彼女の目撃者の証言を確認しました。彼女は、チップの近くのアラームについて警告するメールを受け取ったため、確認に行ったと主張しました。\nメールログを検索すると、彼女がノーマン・オーウェンズからメールを受け取ったことがわかりました。ノーマン自身は、送信者IDがNULLの2つの疑わしいメッセージを受け取っていました。1つのメールはノーマンに「Lを所定の位置に移動させる」ように指示し、もう1つは施設18のロックを解除して誰かが「物事を終わらせる」ことができるように指示しました。\nこれにより、その日の施設アクセスログを確認することになりました。施設18にアクセスしたのは2人だけでした：エリザベス・ゴードンと、その直後のもう1人—フリスト・ボゴエフ。"
  },
  "case-006": {
    "title": "消えたダイヤモンド",
    "description": "有名な「アトランティスの心臓」ダイヤモンドネックレスが、チャリティガラのディスプレイから突然消えました。",
    "brief": "マイアミの名門フォンテーヌブローホテルのチャリティガラで、有名な「アトランティスの心臓」ダイヤモンドネックレスがディスプレイから突然消えました。",
    "objectives": [
      "ダイヤモンドを盗んだ人物を見つけてください。"
    ],
    "successMessage": "優れた探偵の仕事です！証拠は決定的にマイク・マニングが泥棒であることを示しています。",
    "explanation": "犯罪現場の記録を取得し、目撃者の証言を調べることから始めました。証言には、ドックレンタル、VIP-R招待状の一部、ネイビースーツが言及されていました。\nこれらの手がかりでマリーナレンタルをフィルタリングすると、複数のエントリが返されました。\nゲストテーブルと服装登録との複数のJOINにより、1人の候補者が返されました。\nその候補者との最終面接により、自白が得られました。\nしたがって、真の泥棒はマイク・マニングです。"
  }
}
